//
//  main.c
//  04-注释
//
//  Created by 星尘 on 14-9-1.
//  Copyright (c) 2014年 zb737472783. All rights reserved.
//

/*
    注释
        注解,解释的意思
        注释主要是用来解释自己的代码功能,方便自己或者其他人阅读你的代码
                帮助自己快速回忆代码的功能
        单行注释
        多行注释
        注释可以写在文件的任意位置
        在当前文件中搜索注释能够帮助我们快速定位到相关的位置
        最强大的功能是可以写汉字,方便检索,快速定位代码块
        被注释掉的代码不会参与程序的执行逻辑当中
        command + ? 快速注释
        注释往往是一些大公司的硬性要求
 */

#include <stdio.h>
    //  播放音乐功能
int playMusic()
{
    return 0;
}

/*
     mian 函数主要用于启动应用程序
     main 函数是程序的入口
     如果没有 main 函数,程序将不能运行
 */
int main()
{
        // printf 调用系统打印输出函数,能够在控制台输出结果
    printf("静心学习\n");
        //printf("热爱科技,热爱生活");  //  不会参与到程序的执行逻辑中
    return 0; // 返回一个0
}   //  代表代码块结束