//
//  main.c
//  05-数据类型
//
//  Created by 星尘 on 14-9-1.
//  Copyright (c) 2014年 zb737472783. All rights reserved.
//

/*
    C 语言中的数据类型

    软件编程的实质 : 数据处理(数据传递, 数据计算)
                               思想的转换(把你想象到的东西,转换成计算机能够识别的语言)
        数据大小
            bit 比特位       计算机中最小的单位
            byte 字节位    1 byte = 8 bit              汉字占3个字节   字节是计算机最为常用的单位
            KB(千字节)      1 KB = 1024 byte
            MB(兆字节)     1 MB = 1024 KB
            GB                  1 GB = 1024 MB
            TB                   1 TB = 1024 GB
        数据类型
            基本数据类型
                    int char double float
                int 表示整数 占4个字节    100
                char 表示字符  占1个字节  'a'
                float  表示 单精度浮点数  有效位数是7位  占4个字节  3.1415926f
                double 表示 双精度浮点数  占用8个字节  有效位数是15位   程序中默认的小数都是双精度类型
            构造类型
            指针类型
            空类型
    为什么有数据类型
        就是要让我们的应用程序更加合理的分配内存空间
 */


int main()
{
    return 0;
}