//
//  main.c
//  01-第一个 C 语言程序
//
//  Created by 星尘 on 14-9-1.
//  Copyright (c) 2014年 zb737472783. All rights reserved.
//

/*
    OC是在 C 语言的基础上增加了一些编程思想,增加了一些语法
    很多经典的流行的其他语言都是在 C 语言的基础上衍生而来的,C++,C#,Java
    C 语言入门相对简单,但精通很难
        C 语言是由一个又一个的函数构成的
            函数最主要的功能就是用来封装一些完成独立功能的代码块
                main : 是 C 语言程序的入口函数
                          当程序启动的时候首先调用 main 函数
                          创建项目文件的时候会默认给我创建一个 main 函数
                          小括号是一个函数的标志,如果没有括号就一定不是函数
                          ; 代表是一条语句的结束
                          程序已启动,main 函数中的代码就会从上到下按照顺序执行
                          在同一个文件中不能够同时定义两个名字相同的函数
                          在同一个项目工程中只能有一个 main 函数,否咋会导致程序启动时无法找到是启动哪一个 main 函数
                printf : 不是自己写的函数,是系统自动提供给我们使用的工具函数
                            要想使用 printf 函数必须引入#include<stdio.h>
                            \n 代表换行的意思
                            在 main 函数中可以多次调用同一个函数
 */

#include <stdio.h> // 代表引入 stdio.h 文件的意思

int play()
{
        // 加载音乐文件
        // 播放功能代码
    printf("播放音乐...\n");
        //play(); // 调用自己就会产生死循环
    return 0;
}

int main()
{
    play(); // 调用函数的方式
    printf("静心学习\n");

        // 输出图形
    printf("****\n");
    printf("****\n");
    printf("****\n");
    play(); // 严格按照顺序执行

    stop(); // 警告不符合 C99标准
    return 0; // 一定要写上这句代码
} // main 函数的代码块 用来封装一系列的逻辑代码

int stop()
{
    return 0;
}
